[
  {
    "title": "Protocol & Tokenomics Architecture",
    "info": "Incentivize users to adopt and utilize your project and help your project and its ecosystem grow.",
    "image": "https://drive.google.com/file/d/1bvicGmRYeMcVCB1O2YS13E6RNWzVp5b7/view?usp=share_link"
  },
  {
    "title": "Whitepaper Development",
    "info": "Gain credibility with your audience with professional academic writing, precise language, and thorough whitepaper reviews and audits from the initial draft to a published document.",
    "image": "../assets/Images/S1.svg"
  },
  {
    "title": "Smart Contract Development ",
    "info": "Whether you are in need of a smart contract or have deployed one already, our team will optimize for security, gas cost, functionality, and scalability.",
    "image": "../assets/Images/S1.svg"
  },
  {
    "title": "dApp Development",
    "info": "So your users can interact with your business’ decentralized application. ",
    "image": "../assets/Images/S1.svg"
  },
  {
    "title": "Market and Economic Consulting and Research",
    "info": "Direct access to the BSR team with targeted, relevant business intelligence from our specialists. Get the critical insights and information that your business needs.",
    "image": "../assets/Images/S1.svg"
  },
  {
    "title": "Real World Asset Tokenization and On-Chain Bridge",
    "info": "Our technologies transform the private and public equity market and eliminate inherent market inefficiencies. Bring transparency, liquidity, and security to your asset.",
    "image": "../assets/Images/S1.svg"
  },
  {
    "title": "iOS/Android App Development",
    "info": "Build a smartphone application with blockchain technology directly integrated",
    "image": "../assets/Images/S1.svg"
  },
  {
    "title": "Project Management",
    "info": "Connect with the right partners and ecosystems. Ensure that your project delivers the highest quality experience.",
    "image": "../assets/Images/S1.svg"
  },
  {
    "title": "Quantitative Algorithmic Trading Strategies",
    "info": "Capitalize on market inefficiencies, illiquidity, and business intelligence with automated real time trading, market making, and quantitative strategies.",
    "image": "../assets/Images/S1.svg"
  },
  {
    "title": "Real World Asset Tokenization and On-Chain Bridge",
    "info": "Bridge real-world assets onto the blockchain utilizing our complete stack technology and services platform that is fully SEC-compliant. Integrates blockchain and Web3 technology, allowing any assets or securities to join the crypto revolution.",
    "image": "../assets/Images/S1.svg"
  },
  {
    "title": "Citizen Protocol",
    "info": "A novel iteration of a decentralized autonomous organization and protocol, offering users a venue to generate highly-efficient stablecoin liquidity against a basket of digital and real-world assets."
  },
  {
    "title": "Governance and Corporate Management",
    "info": "Securely manage critical business decisions in private, custom environments with our unique governance solution. Automate and optimize the stratification of power between managing members and decision-making personnel."
  },
  {
    "title": "",
    "info": ""
  },
  {
    "title": "",
    "info": ""
  }
]