[
  {
    "name": "John Wilks - Managing Director",
    "info": "Foundations originally lay within Venture Capital, Investment Banking, and Private Equity. He has therefore been involved in both the buy-side and sell-side aspect of financial transactions. Mr. Wilks has experience with valuation, forecasting, & business development. Upon exiting corporate finance, he has turned his focus almost entirely to internet marketing, direct response advertising, disruptive online higher education technology, and other online verticals.His companies have varied from employing 20-150 professionals, both domestic & international, with revenues consistently well over $10M per year & ROI’s to investors 20%-200%. John Wilks's first entrepreneurial focus / company was formed at the age of 27 years old."
  },
  {
    "name": "Asa Allen - Managing Director",
    "info": "Owner of Allen Theatres Inc. which is one of the largest privately owned Movie Theatre chains in America with locations in New Mexico, Colorado, and Arizona.  Allen Theatres Inc. has been in business for 109 years.  He has spent significant time working with studios to develop social media content for theatre accounts.  Asa is directly involved in movie studio distribution and film negotiations. Mr. Allen has also spent time building and selling residential real-estate, as well as market analysis for theatre development projects.  Mr. Allen has also spent time affiliated with investment banks, vetting potential M&As, and capital raises for various business ventures."
  },
  {
    "name": "Donald Hulke - Board Member",
    "info": "Donald (Don) Hulke is the Founder and Managing Director of Legion Financial, LLC (Legion). Don provides expert financial services to companies, lenders, creditors, trustees, and legal counsel in complex matters involving bankruptcy, restructuring, litigation, investigation, distressed and non-distressed sales, business valuation, and asset monitoring and recovery.Don has served and worked as a court-appointed receiver on more than fifty matters involving operating entities, commercial and residential real-estate, and other specific assets. Don has been appointed as an examiner by the United States Trustee for the District of Arizona.Don has served as an expert in Superior Court, Bankruptcy Court, and mediation proceedings in complex commercial litigation and bankruptcy matters. His litigation services include analysis of economic, financial, and operational information in the assessment of damages in matters including business interruption, breach of contract, intellectual property, and other commercial litigation matters.Don has served as an advisor, consultant, expert, and fiduciary to clients in various industries, including manufacturing, construction, energy, utilities, airline, aerospace, financial services, licensing, gaming, tribal matters, hotel, restaurant, franchise, gas station, retail, online, service, publishing, printing, agriculture, and commercial and residential real-estate."
  },
  {
    "name": "Greg Nelson - General Counsel",
    "info": "An attorney with 20+ years of legal experience with multi-billion dollar corporations. Greg brings a unique combination of experience blending and negotiating agreements and policies, prosecuting and managing intellectual property, and enforcing and litigating contracts, IP, and other corporate interests. Greg brings a perspective to matters with a focus on handling matters efficiently from a real-world business perspective to help companies accomplish their business goals while aggressively protecting their interests. Greg and the firm have provided a wide range of services, with a focus on general counsel, corporate work, civil litigation, and brand enforcement. Greg graduated summa cum laude. After passing the California bar exam, Greg passed the patent bar exam, becoming a registered patent attorney. He is also admitted to practice in Massachusetts and before state and federal courts throughout both California and Massachusetts."
  },
  {
    "name": "Van Oakes - Media/Marketing",
    "info": "Van is an International Expert in the Performance Marketing Space. Van has built multiple 6-8 figure businesses and exited 2 of them. Most notably, Van helped scale Diesel Power Gear, featured on Discovery channels hit TV show “Diesel Brothers”, from $4M to $30M in Revenue in 2020. Van is a active international speaker at marketing events all over the world since 2018, where he trains thousands on cutting edge advertising techniques. In 2019 Van was awarded the “Snapchat Star of the Year” award for his work on their platform. Currently Van is involved in multiple direct to consumer brands, is the founder and CEO of GOAT Media, and sits on numerous boards for his expertise in online marketing."
  },
  {
    "name": "Jesse Crowne - Venture Capital",
    "info": "Jesse Crowne has over 26 years of experience working with rapidly growing healthcare companies. Currently, Mr. Crowne is a Managing Director with ICW Healthcare Ventures, an early-stage healthcare dedicated venture fund, and serves as Chief Executive Officer of Nepetx, a pre-clinical biotech company developing an orally administered enzymatic therapy for the treatment of Celiac Disease. Previously, Mr. Crowne served as Executive Co-Chairman at Medovex Corporation, a publicly traded medical device company focused on commercializing a single use treatment for lower back pain (facet joint syndrome) that provides long-term pain relief. Prior to that, Jesse served as President of Vavotar Life Sciences, a clinical stage biotech company developing antibody-drug conjugates for oncology applications. Prior to joining ICW, Mr. Crowne was an associate with White Pine Medical, a private equity investment vehicle and subsidiary of Essex Woodlands focused on the medical device sector. Within White Pine, Jesse was responsible for tracking and reporting portfolio company performance, completing market research, developing financial models, sourcing deal flow, leading due diligence, and presenting financial plans and strategic initiatives to general and limited partners. Mr. Crowne has experience with funding VC, PIPE, SPAC, and IPO capital structures. Mr. Crowne received an MBA and an MPH from Westminster College and BS degrees in Biology and Economics from the University of Utah."
  },
  {
    "name": "Brent Crosby - Board Member",
    "info": "A Utah native with over 10 years of experience in real estate investing across the mountain west and Midwest. Focus on self storage facilities in tertiary markets. Current owner and partner in over 15 million in self storage assets. Degrees in Finance and Economics. Former Goldman Sachs Analyst."
  }
]